[
    {
        "title": "Firewall blockiert eingehenden Datenverkehr während automatisierter Backups",
        "id": 1,
        "description": "Einleitung\nDie Firewall blockiert unerwartet den eingehenden Datenverkehr während der Durchführung von automatisierten Backups.\n\nHintergrundinformationen\nDie automatisierten Backups laufen täglich. Während dieser Zeit sollte der eingehende Datenverkehr normal weiterlaufen.\n\nSchritte zur Reproduktion\nStellen Sie die Firewall-Regeln wie gewöhnlich ein und starten Sie das automatische Backup um 2 Uhr morgens.\n\nErwartetes Verhalten\nDer Datenverkehr sollte während des Backups nicht beeinträchtigt werden.\n\nTatsächliches Verhalten\nDer gesamte eingehende Datenverkehr wird blockiert, was zu einem temporären Ausfall führt.\n\nZusätzliche Informationen\n",
        "status": "New",
        "loesungsvorschlag": "Überprüfen Sie die Firewall-Einstellungen und stellen Sie sicher, dass es keine Konflikte mit den Backup-Prozessen gibt.",
        "timestamp": "2024-08-10T14:00:00.000Z",
        "creator": "User2",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-08-10T14:10:00.000Z",
        "impact": "Netzwerkverbindung",
        "affectedSystems": [
            "Firewall-01"
        ],
        "alertType": "Error",
        "incidentType": "Security",
        "priority": 2,
        "severity": "High",
        "preventativeMeasures": "Überprüfung der Firewall-Konfiguration und Sicherstellung, dass die Backup-Prozesse nicht beeinträchtigt werden.",
        "attachments": [
            ""
        ],
        "comments": [],
        "isInitialGiven": false,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": false
    },
    {
        "title": "Datenbank-Server stürzt ab sobald Update-Prozess gestartet wird",
        "id": 2,
        "description": "Einleitung\nDer Datenbank-Server stürzt ab, sobald der Update-Prozess eingeleitet wird.\n\nHintergrundinformationen\nDer Server wird regelmässig aktualisiert, um Sicherheits- und Funktionsupdates zu erhalten.\n\nSchritte zur Reproduktion\nInitiieren Sie den Update-Prozess über die Verwaltungsoberfläche.\n\nErwartetes Verhalten\nDer Update-Prozess sollte reibungslos ablaufen und der Server sollte danach weiterhin funktionieren.\n\nTatsächliches Verhalten\nDer Server stürzt ab und muss manuell neu gestartet werden.\n\nZusätzliche Informationen\nStellen Sie sicher, dass die Updates kompatibel sind und keine Konflikte mit bestehenden Systemkomponenten verursachen.",
        "status": "New",
        "loesungsvorschlag": "Führen Sie vor dem Update einen Kompatibilitätstest durch und sichern Sie die Datenbank, um Datenverlust zu vermeiden.",
        "timestamp": "2024-08-15T09:00:00.000Z",
        "creator": "User3",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "",
        "impact": "Datenbankverfügbarkeit",
        "affectedSystems": [
            "DatabaseServer-01"
        ],
        "alertType": "Error",
        "incidentType": "Processes",
        "priority": 1,
        "severity": "Critical",
        "preventativeMeasures": "Vor dem Update sicherstellen, dass alle Abhängigkeiten kompatibel sind und ein Backup vor dem Prozess durchführen.",
        "attachments": [
            ""
        ],
        "comments": [],
        "isInitialGiven": false,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": false
    },
    {
        "title": "Speicherkomponente zeigt Fehlverhalten beim Schreiben grosser Dateien",
        "id": 3,
        "description": "Einleitung\nBeim Versuch, grosse Dateien zu speichern, zeigt die Speicherkomponente Fehlverhalten und verursacht Datenverluste.\n\nHintergrundinformationen\nDie Speicherkomponente ist für die Speicherung grosser Datenmengen in einem zentralen System verantwortlich.\n\nSchritte zur Reproduktion\n1. Initiieren Sie das Schreiben einer grossen Datei (>2 GB) auf die Speicherkomponente.\n2. Überwachen Sie den Schreibvorgang und die resultierenden Systemlogs.\n\nErwartetes Verhalten\nDie Datei sollte ohne Fehler vollständig gespeichert werden.\n\nTatsächliches Verhalten\nDer Schreibvorgang wird abgebrochen, und es kommt zu Datenverlusten.\n\nZusätzliche Informationen\n",
        "status": "Open",
        "loesungsvorschlag": "Führen Sie eine Überprüfung und ein Upgrade der Speicherkomponente durch, um die Handhabung grosser Dateien zu verbessern.",
        "timestamp": "2024-06-01T14:20:00.000Z",
        "creator": "User4",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-06-01T14:25:00.000Z",
        "impact": "Datenspeicherung",
        "affectedSystems": [
            "ProxyServer-01"
        ],
        "alertType": "Error",
        "incidentType": "Data Integrity",
        "priority": 1,
        "severity": "High",
        "preventativeMeasures": "Überprüfung und Upgrade der Speicherkomponente",
        "attachments": [
            ""
        ],
        "comments": [],
        "isInitialGiven": true,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": false
    },
    {
        "title": "Datenbankmodul verursacht Verbindungsfehler bei mehreren gleichzeitigen Zugriffen",
        "id": 4,
        "description": "Einleitung\nDas Datenbankmodul bricht Verbindungen ab, wenn mehrere Benutzer gleichzeitig darauf zugreifen. Dies beeinträchtigt die Datenbankleistung erheblich.\n\nHintergrundinformationen\nDas Problem tritt auf, wenn die Anzahl gleichzeitiger Verbindungen die derzeitige Kapazität des Datenbankmoduls überschreitet.\n\nSchritte zur Reproduktion\n1. Führen Sie eine Lasttest-Sitzung mit mehreren gleichzeitigen Benutzern durch.\n2. Beobachten Sie die Stabilität der Datenbankverbindungen.\n\nErwartetes Verhalten\nDie Datenbank sollte mehrere gleichzeitige Verbindungen ohne Abbrüche verarbeiten.\n\nTatsächliches Verhalten\nDie Datenbankverbindungen brechen ab, was zu einer erheblichen Beeinträchtigung der Leistung führt.\n\nZusätzliche Informationen\n",
        "status": "In Progress",
        "loesungsvorschlag": "Überprüfen Sie die aktuelle Verbindungskapazität und optimieren Sie die Datenbankkonfiguration, um mehrere gleichzeitige Verbindungen besser zu handhaben.",
        "timestamp": "2024-08-16T14:30:00.000Z",
        "creator": "User5",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-08-16T14:49:00.000Z",
        "impact": "Datenbankverfügbarkeit",
        "affectedSystems": [
            "ApplicationServer-01"
        ],
        "alertType": "Warning",
        "incidentType": "Connection",
        "priority": 2,
        "severity": "Medium",
        "preventativeMeasures": "Optimierung der Datenbankkonfiguration und Erhöhung der Verbindungskapazität",
        "attachments": [
            ""
        ],
        "comments": [],
        "isInitialGiven": true,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": false
    },
    {
        "title": "Fehlermeldung 500 tritt auf bei Datenabfrage in Berichtssystem",
        "id": 5,
        "description": "Einleitung\nBeim Ausführen von Datenabfragen im Berichtssystem erscheint regelmässig eine Fehlermeldung 500. Dies verhindert den Zugriff auf benötigte Berichte.\n\nHintergrundinformationen\nDie Fehlermeldung 500 deutet auf einen internen Serverfehler hin, der auftritt, wenn das Berichtssystem eine Abfrage verarbeitet.\n\nSchritte zur Reproduktion\n1. Melden Sie sich im Berichtssystem an.\n2. Führen Sie eine Standard-Datenabfrage durch.\n\nErwartetes Verhalten\nDie Abfrage sollte erfolgreich ausgeführt und der Bericht ohne Fehler angezeigt werden.\n\nTatsächliches Verhalten\nStattdessen erscheint die Fehlermeldung 500, und der Bericht wird nicht geladen.\n\nZusätzliche Informationen\nDas Problem tritt sporadisch auf und betrifft verschiedene Berichtsarten. Eine tiefere Analyse der Abfrageprozesse ist erforderlich.",
        "status": "New",
        "loesungsvorschlag": "Überprüfen Sie die Abfrageprozesse und optimieren Sie die Berichtsdatenbank, um interne Serverfehler zu vermeiden.",
        "timestamp": "2024-03-01T14:40:00.000Z",
        "creator": "User6",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "",
        "impact": "Berichtserstellung",
        "affectedSystems": [
            "LoadBalancer-01"
        ],
        "alertType": "Error",
        "incidentType": "Query",
        "priority": 1,
        "severity": "High",
        "preventativeMeasures": "Fehleranalyse der Abfrageprozesse und Optimierung der Berichtsdatenbank",
        "attachments": [
            ""
        ],
        "comments": [],
        "isInitialGiven": false,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": false
    },
    {
        "title": "Backup-Modul reagiert nicht auf Fehler bei Speicherplatzmangel",
        "id": 6,
        "description": "Einleitung\nDas Backup-Modul ignoriert Fehler, die durch unzureichenden Speicherplatz verursacht werden, und fährt fort, ohne Daten zu sichern.\n\nHintergrundinformationen\nDas Backup-Modul sollte Fehler melden und den Backup-Prozess unterbrechen, wenn der Speicherplatz nicht ausreicht.\n\nSchritte zur Reproduktion\n1. Reduzieren Sie den verfügbaren Speicherplatz auf dem Zielserver.\n2. Starten Sie einen Backup-Prozess.\n\nErwartetes Verhalten\nDer Backup-Prozess sollte pausieren oder abbrechen, wenn der Speicherplatz nicht ausreicht, und eine Fehlermeldung anzeigen.\n\nTatsächliches Verhalten\nDas Modul ignoriert den Speicherplatzmangel und fährt fort, ohne eine Fehlermeldung auszugeben.\n\nZusätzliche Informationen\n",
        "status": "In Progress",
        "loesungsvorschlag": "Erweitern Sie den verfügbaren Speicherplatz und passen Sie die Backup-Einstellungen an, um sicherzustellen, dass der Prozess bei Speicherplatzmangel korrekt reagiert.",
        "timestamp": "2024-08-12T14:50:00.000Z",
        "creator": "User7",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-08-15T14:55:00.000Z",
        "impact": "Datensicherung",
        "affectedSystems": [
            "DevelopmentServer-01"
        ],
        "alertType": "Error",
        "incidentType": "Backups",
        "priority": 1,
        "severity": "High",
        "preventativeMeasures": "",
        "attachments": [
            ""
        ],
        "comments": [],
        "isInitialGiven": true,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": true
    },
    {
        "title": "Überwachungssystem zeigt falsche Alarme unter Lastbedingungen",
        "id": 7,
        "description": "Einleitung\nDas Überwachungssystem generiert falsche Alarme, wenn es unter Lastbedingungen arbeitet. Dies führt zu unnötigen Unterbrechungen und Fehlalarmen.\n\nHintergrundinformationen\nDas Überwachungssystem soll unter normalen und Lastbedingungen präzise arbeiten und nur bei tatsächlichen Problemen Alarme auslösen.\n\nSchritte zur Reproduktion\n1. Erhöhen Sie die Systemlast auf ein hohes Niveau.\n2. Beobachten Sie die generierten Alarme.\n\nErwartetes Verhalten\nDas Überwachungssystem sollte nur bei tatsächlichen Problemen Alarme auslösen, unabhängig von der Systemlast.\n\nTatsächliches Verhalten\nUnter hoher Last werden falsche Alarme generiert, die zu unnötigen Unterbrechungen führen.\n\nZusätzliche Informationen\nDas Problem tritt hauptsächlich bei hoher CPU- oder Speicherauslastung auf. Eine Kalibrierung der Überwachungssysteme und Anpassung der Alarmschwellenwerte wird empfohlen.",
        "status": "Open",
        "timestamp": "2024-03-01T15:00:00.000Z",
        "creator": "User8",
        "loesungsvorschlag": "Kalibrieren Sie das Überwachungssystem und passen Sie die Alarmschwellenwerte an, um unnötige Alarme unter Lastbedingungen zu vermeiden.",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-03-01T15:05:00.000Z",
        "impact": "Systemüberwachung",
        "affectedSystems": [
            "ProxyServer-01"
        ],
        "alertType": "Info",
        "incidentType": "Monitoring",
        "priority": 2,
        "severity": "Medium",
        "preventativeMeasures": "Kalibrierung der Überwachungssysteme und Anpassung der Alarmschwellenwerte",
        "attachments": [
            ""
        ],
        "comments": [],
        "isInitialGiven": false,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": true
    },
    {
        "title": "Speicherplatzverwaltung verursacht Datenverlust bei hoher Last",
        "id": 8,
        "description": "Einleitung\nBei hoher Last führt die Speicherplatzverwaltung zu erheblichen Problemen, einschliesslich Datenverlust.\n\nHintergrundinformationen\nDas Problem tritt auf, wenn das System unter hoher Last steht, insbesondere während intensiver Lese- und Schreibvorgänge. Die Speicherplatzverwaltung scheint unter diesen Bedingungen nicht ordnungsgemäss zu funktionieren.\n\nSchritte zur Reproduktion\n1. Führen Sie mehrere gleichzeitige Lese- und Schreibvorgänge durch, während das System unter hoher Last steht.\n2. Überwachen Sie die Datenkonsistenz und speichern Sie die Ergebnisse.\n\nErwartetes Verhalten\nDie Speicherplatzverwaltung sollte unabhängig von der Systemlast zuverlässig funktionieren und die Datenintegrität gewährleisten.\n\nTatsächliches Verhalten\nUnter hoher Last kommt es zu Datenverlusten und Inkonsistenzen in den gespeicherten Daten.\n\nZusätzliche Informationen\nLogdateien und Systemberichte wurden beigefügt, um das Problem zu dokumentieren.",
        "status": "Open",
        "loesungsvorschlag": "Optimierung der Speicherplatzverwaltung und Implementierung eines Mechanismus zur besseren Handhabung von Lastspitzen.",
        "timestamp": "2024-08-06T07:43:55.048651",
        "creator": "User9",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-08-07T10:43:48.048651",
        "impact": "Erheblicher Datenverlust bei hoher Systemlast.",
        "affectedSystems": [
            "Firewall-01"
        ],
        "alertType": "Error",
        "incidentType": "Storage",
        "priority": 4,
        "severity": "Medium",
        "preventativeMeasures": "Einführung eines robusteren Lastmanagements für die Speicherplatzverwaltung, um Datenverlust zu verhindern.",
        "attachments": [
            "logfile.txt"
        ],
        "comments": [],
        "isInitialGiven": false,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": true
    },
    {
        "title": "DNS-Auflösung schlägt fehl bei Verbindungen zu externen Servern",
        "id": 9,
        "description": "Einleitung\nDie DNS-Auflösung schlägt fehl, wenn versucht wird, eine Verbindung zu externen Servern herzustellen. Dies führt zu Verbindungsabbrüchen und langsamen Antwortzeiten.\n\nHintergrundinformationen\nDas System verwendet einen internen DNS-Server, um externe Domain-Namen aufzulösen. Bei erhöhtem Netzwerkverkehr scheint der DNS-Server überlastet zu sein, was zu Ausfällen führt.\n\nSchritte zur Reproduktion\n1. Versuchen Sie, eine Verbindung zu einem externen Server herzustellen, während das Netzwerk stark ausgelastet ist.\n2. Beobachten Sie, ob die DNS-Auflösung erfolgreich ist.\n\nErwartetes Verhalten\nDie DNS-Auflösung sollte zuverlässig und ohne Verzögerungen erfolgen, sodass Verbindungen zu externen Servern problemlos hergestellt werden können.\n\nTatsächliches Verhalten\nDie DNS-Auflösung schlägt fehl oder dauert ungewöhnlich lange, was zu Verbindungsabbrüchen führt.\n\nZusätzliche Informationen\nNetzwerk-Logs und DNS-Server-Protokolle wurden beigefügt. Es scheint ein Problem mit der Skalierbarkeit des DNS-Servers zu sein, insbesondere unter hoher Netzwerklast.",
        "status": "In Progress",
        "loesungsvorschlag": "Überprüfung und Skalierung des DNS-Servers, um sicherzustellen, dass er auch unter hoher Last zuverlässig arbeitet. Erwägen Sie den Einsatz von sekundären DNS-Servern, um die Last zu verteilen.",
        "timestamp": "2024-08-10T14:00:00.000Z",
        "creator": "User2",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-08-11T14:11:00.000Z",
        "impact": "Verbindungsprobleme mit externen Servern, was zu Ausfällen und verzögerten Antwortzeiten führt.",
        "affectedSystems": [
            "DNSServer-01"
        ],
        "alertType": "Error",
        "incidentType": "Network",
        "priority": 1,
        "severity": "High",
        "preventativeMeasures": "Implementierung eines Load-Balancing-Systems für DNS-Anfragen und Skalierung der DNS-Server-Kapazität.",
        "attachments": [],
        "comments": [],
        "isInitialGiven": true,
        "commands": [],
        "commandResponses": [],
        "wizardFeedback": false
    },
    {
        "title": "DNS-Auflösung schlägt fehl beim Zugriff auf PRTG Core Server",
        "id": 10,
        "description": "Einleitung\nBeim Versuch, den PRTG Core Server zu erreichen, schlägt die DNS-Auflösung fehl, was den Zugriff auf den Server verhindert.\n\nHintergrundinformationen\nDas Problem wurde festgestellt, als Benutzer versuchten, den PRTG Core Server über seinen Hostnamen zu erreichen. Der Servername wird nicht korrekt aufgelöst, was zu Zugriffsproblemen führt.\n\nSchritte zur Reproduktion\n1. Öffnen Sie ein Terminal oder eine Netzwerküberwachungsanwendung.\n2. Versuchen Sie, den PRTG Core Server über seinen Hostnamen zu erreichen.\n3. Überprüfen Sie, ob die DNS-Auflösung erfolgreich ist.\n\nErwartetes Verhalten\nDer Hostname des PRTG Core Servers sollte korrekt aufgelöst werden, sodass der Server erreichbar ist.\n\nTatsächliches Verhalten\nDie DNS-Auflösung schlägt fehl, und der PRTG Core Server kann nicht über seinen Hostnamen erreicht werden.\n\nZusätzliche Informationen\n- Log-Datei beigefügt\n- Tritt auf in Version 3.4.1\n- Keine Auswirkungen auf andere Systeme festgestellt.",
        "status": "Open",
        "timestamp": "2024-03-01T14:08:00.000Z",
        "loesungsvorschlag": "Überprüfen Sie die DNS-Konfiguration und stellen Sie sicher, dass der Hostname des PRTG Core Servers korrekt eingetragen ist. Eine alternative Lösung könnte darin bestehen, den Server direkt über seine IP-Adresse anzusprechen.",
        "creator": "User2",
        "duration": 0,
        "endTime": "",
        "lastUpdated": "2024-03-02T14:10:00.000Z",
        "impact": "Systemüberwachungsberichte können nicht generiert werden, was zu einem Mangel an Überwachung der Netzwerkperformance führt",
        "affectedSystems": [
            "DevelopmentServer-01",
            "ERPSystem-01"
        ],
        "alertType": "Warning",
        "incidentType": "Configuration",
        "priority": 1,
        "severity": "Low",
        "preventativeMeasures": "Keine vorbeugenden Massnahmen erforderlich",
        "attachments": [
            "logfile.txt"
        ],
        "comments": [
            "Benutzer konnte den PRTG Core Server nicht finden",
            "CURIX-Konfiguration überprüfen"
        ],
        "isInitialGiven": false,
        "commands": [
            "sudo systemctl restart prtg",
            "sudo systemctl status prtg",
            "sudo systemctl enable prtg"
        ],
        "commandResponses": [
            [
                "Restarting PRTG Core Server service...",
                "PRTG Core Server service restarted successfully."
            ],
            [
                "Fetching status of PRTG Core Server service...",
                "PRTG Core Server service is active and running."
            ],
            [
                "Enabling PRTG Core Server service...",
                "PRTG Core Server service enabled to start at boot."
            ]
        ],
        "wizardFeedback": false
    }
]